In [1]:
import pandas as pd
train_df = pd.read_csv(r"C:\Users\divya\Desktop\ML\titanic_data\train.csv")
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
train_set =train_df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','Survived'], axis=1)
target = train_df['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [17]:
train_set.dropna(inplace = True)

In [3]:
train_set.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [4]:
print(train_set.groupby(['Sex', 'Pclass'])['Age'].agg(['mean', 'median']).round(1))

               mean  median
Sex    Pclass
female 1       34.6    35.0
       2       28.7    28.0
       3       21.8    21.5
male   1       41.3    40.0
       2       30.7    30.0
       3       26.5    25.0

In [22]:
by_sex_class = train_set.groupby(['Sex', 'Pclass'])['Age'].agg(['mean', 'median']).round(1)
print(by_sex_class)

               mean  median
Sex    Pclass
female 1       34.6    35.0
       2       28.7    28.0
       3       21.8    21.5
male   1       41.3    40.0
       2       30.7    30.0
       3       26.5    25.0

In [5]:
train_set.describe()

           Pclass         Age        Fare
count  891.000000  714.000000  891.000000
mean     2.308642   29.699118   32.204208
std      0.836071   14.526497   49.693429
min      1.000000    0.420000    0.000000
25%      2.000000   20.125000    7.910400
50%      3.000000   28.000000   14.454200
75%      3.000000   38.000000   31.000000
max      3.000000   80.000000  512.329200

In [6]:
train_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     714 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 28.0+ KB

train_set.isnull().sum()

In [12]:
train_set.isnull().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [8]:
train_set['Age'].mean()
train_set['Age'].median()
train_set['Age'].mode()

0    24.0
dtype: float64

In [40]:
train_set['Age'].mean()

29.69911764705882

In [9]:
train_set['Age'] = train_set['Age'].fillna(train_set['Age'].mean())

In [10]:
train_set['Age'].median()

29.69911764705882

train_set['Age'].mode()

In [39]:
train_set['Age'].mode()

0    24.0
dtype: float64

In [11]:
train_set.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
le_Pclass = LabelEncoder()
le_Sex = LabelEncoder()
le_Age = LabelEncoder()
le_Fare = LabelEncoder()

In [22]:
train_set['Sex_n'] = le_Sex.fit_transform(train_set['Sex'])
train_set.head()

   Pclass     Sex   Age     Fare  Sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [24]:
train_f = train_set.drop('Sex', axis='columns')
train_f.head()

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [25]:
from sklearn import tree
`

In [34]:
model = tree.DecisionTreeClassifier()
model.summary()

AttributeError: 'DecisionTreeClassifier' object has no attribute 'summary'

In [35]:
model.fit(train_f,target)

DecisionTreeClassifier()

In [36]:
model.score(train_f,target)

0.9797979797979798

In [45]:
model.predict([[1,32.5,211.5,1]])

array([0], dtype=int64)

In [42]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64